<a href="https://colab.research.google.com/github/mnickols/CSC-302-W1/blob/main/HW1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Import Google Drive and Pandas

In [1]:
from google.colab import drive
drive.mount('/content/drive')
import pandas as pd

Mounted at /content/drive

Read the olympic medals data

In [23]:
df = pd.read_csv('/content/drive/MyDrive/DATA/olympic_medals.csv')

2 a) Find the size of the data frame

In [11]:
df.shape
#(rows, columns)
#(2394, 8)

(2394, 8)

2 b) Use the appropriate function to report the data types for all columns.

In [12]:
df.dtypes

Gender         object
Event          object
Location       object
Year            int64
Medal          object
Name           object
Nationality    object
Result         object
dtype: object

2 c) Find how many unique cities matches were held at

In [13]:
len(df['Location'].unique())

23

2 d) Find how many medals the USA team won in total

In [22]:
df[df["Nationality"]=='USA']['Medal'].count()

638

2 e) Find the total number of medals for each Nationality.

In [17]:
df.groupby(by='Nationality')['Medal'].count()

Nationality
ALG      9
ARG      4
AUS     57
AUT      4
BAH     12
      ...
URS    131
USA    638
VEN      2
YUG      1
ZAM      1
Name: Medal, Length: 97, dtype: int64